//
//标题  
//自然数分解 
// 
//类别 
//流程控制 
//  
//时间限制  
//2S 
// 
//内存限制  
//1000Kb 
// 
//问题描述  
//任何一个自然数m 的立方均可写成m 个连续奇数之和。例如：   
//  13=1   
//  23=3+5   
//  33=7+9+11   
//  43=13+15+17+19   
//编程实现：输入一自然数n，求组成n3 的n 个连续奇数。   
// 
//输入说明  
//一个正整数n，0<n<30。 
// 
//输出说明  
//输出n 个连续奇数，数据之间用空格隔开，并换行 
// 
//输入样例  
//4 
//输出样例  
//13 15 17 19 
// 
#include<stdio.h>
#include<math.h>

//题干理解错了我以为是输入完全立方数 
int main(){
	int num,n;
	scanf("%d",&num);
	//n = pow(num,1.0/3.0);
	n = num;
	int temp = n*n;
	if(n%2==0){
		for(int i = 1; i <= n; i++){
			printf("%d ",temp-1-n+(i*2));
		}
		printf("\n");
	}
	else{
		for(int i = 1; i <= n; i++){
			printf("%d ",temp-1-n+(i*2));
		}
		printf("\n");
	}
	return 0;
}
